// 1. Написати функцію з одним аргументом, яка перевіряє чи є аргумент парним чи непарним. Функція повинна повернути "even" або "odd" в залежності від того яке то число. Якщо аргумент null то необхідно повернути пусту строку.//


fun isEven(arg: Int?): String {
    // Якщо аргумент null, то повертаємо пусту строку
    if (arg == null) {
        return ""
    }

    // Повертаємо "even" якщо аргумент парний, "odd" в іншому випадку
    return if (arg % 2 == 0) {
        "even"
    } else {
        "odd"
    }
}


// 2. Написати функцію, яка починає перебирати числа від 1 до нескінченності і перевіряє чи є число простим (просте число - те яке ділиться лише на 1 чи само на себе). Якщо просте число знайдене - воно додається до списку (можна використати метод add() списку numbers). Після пʼятого знайденого простого числа функція повинна повернути суму всіх пʼяти простих чисел у списку.//

